[
  {
    "id": "1",
    "title": "Portfolio d'une illustratrice",
    "objectif": "Création d'un site portfolio pour une illustratrice avec HTML, CSS, JavaScript",
    "competences": ["HTML", "CSS/SASS", "JavaScript"],
    "pictures": [
      "/Portfolio/assets/images/portfolio_soreau/catherine-soreau-illustration-fantastique-océan.webp"
    ],
    "description": "Développement de la partie front end du site avec HTML, CSS et JavaScript. Le site est responsive sur téléphone et tablette. J'ai pu réaliser un carousel, un menu burger.",
    "github": "https://github.com/Juju8888A/CS-Portfolio.git"
  },
  {
    "id": "2",
    "title": "Kasa",
    "objectif": "Création d'une application web de location immobilière avec React - OpenClassrooms",
    "competences": ["JavaScript", "React"],
    "pictures": ["/Portfolio/assets/images/kasa/kasa_accueil.webp"],
    "description": "Ce projet m'a permis d'implémenter le front-end d'une application en partant de 0 et en utilisant React et React Router. Je me suis basée sur la maquette founie et utilisé des données extraites d'un fichier JSON. J'ai créé une page d'accueil, à propos, location individuelle et une page d'erreur. J'ai mis en place différents composants et utiliser Sass pour styliser le site.",
    "github": "https://github.com/Juju8888A/OC-Kasa.git",
    "site": "https://juju8888a.github.io/OC-Kasa/"
  },
  {
    "id": "3",
    "title": "Mon vieux grimoire",
    "objectif": "Développement du back-end d'un site de notation de livres - OpenClassrooms",
    "competences": ["MongoDB", "NodeJS", "Express"],
    "pictures": [
      "/Portfolio/assets/images/mon_vieux_grimoire/grimoire_accueil.webp"
    ],
    "description": "Pour le projet Mon vieux grimoire, je me suis occupée de la partie backend du site, j'ai créé un serveur Express et j'ai développé les modèles de données, implémenté des opérations CRUD pour la gestion des livres et notations, implémenté la gestion de téléchargement et d'optimisation des images. J'ai configuré et connecter le base de données MongoDB au projet. J'ai mis en place un système d'authentification pour sécuriser la connexion des utilisateurs.",
    "github": "https://github.com/Juju8888A/OC-Mon-vieux-grimoire.git"
  },

  {
    "id": "4",
    "title": "Portfolio Sophie Bluel",
    "objectif": "Création d'une page web dynamique avec JavaScript - OpenClassrooms",
    "competences": ["JavaScript", "API", "Documentation Swagger"],
    "pictures": [
      "/Portfolio/assets/images/portfolio_sophie_bluel/sophie_bluel_accueil.webp"
    ],
    "description": "Pour ce projet, j'ai cloné le repository du site disponible et j'ai codé la partie affichage des projets sur la page principale, avec la barre de filtres et le formulaire de connexion du site sur la page de connexion. J'ai mis les données des travaux de l'architecte existantes en dynamique et utilisé les requêtes pour communiquer avec l'API, pour récupérer, sauvegarder et supprimer les travaux. J'ai également sécuriser la connexion de l'utilisateur en utilisant un token d'authentification stocké dans le local storage. L'utilisateur peut donc se connecter au site et accéder à l'ajout ou suppression d'un projet.",
    "github": "https://github.com/Juju8888A/OC-Portfolio-Sophie-Bluel.git"
  },
  {
    "id": "5",
    "title": "Portfolio Nina Carducci",
    "objectif": "Optimisation et debug d'un site de photographe - OpenClassrooms",
    "competences": ["SEO", "Accessibilité", "Lighthouse", "Wave"],
    "pictures": [
      "/Portfolio/assets/images/nina_carducci/nina_carducci_accueil.webp"
    ],
    "description": "Sur ce projet, j'ai tout d'abord réalisé un rapport d'audit avec Lightouse sur le code déjà existant. J'ai optimisé les performances du site en effectuant les modifications nécessaires. J'ai optimisé le SEO du site en prêtant attention à la sémantique du code. J'ai minifier les fichiers et ajouté un référencement local. J'ai également corrigé l'accessibilité du site grâce à l'outil Wave.",
    "github": "https://github.com/Juju8888A/OC-Photographe-Nina-Carducci.git"
  },
  {
    "id": "6",
    "title": "Menu Maker by Qwenta",
    "objectif": "Planification du développement du site du client - OpenClassrooms",
    "competences": [
      "Gestion de projet",
      "Kanban",
      "Spécifications techniques",
      "Veille technologique"
    ],
    "pictures": ["/Portfolio/assets/images/menu_maker/menu-maker-accueil.webp"],
    "description": "Sur ce projet, j'ai planifié le développement du site Menu Maker en réalisant un kanban et en organisant le projet avec la méthodologie Agile et Scrum. J'ai créé un planning avec des sprints, estimé la durée du projet grâce aux story points. J'ai également défini les choix techniques, quel framework, api ou base de données allait être nécessaire pour la réalisation du projet. J'ai réalisé une veille technologique pour que l'équipe reste au courant des dernières nouveautés et mises à jour dans le domaine du développement web sur Feedly."
  }
]
